Autodesk.Revit.DB.LinkLoadResult.IsCodeSuccess(Autodesk.Revit.DB.LinkLoadResultType)
Check if load result code signifies success.
code:
Load result code to be verified.
Returns:
True if LinkLoadResultType argument is success, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.GetExternalResourceReferencesFromFailedLoads
Searches this and all nested LinkLoadResults, and returns a list
of ExternalResourceReferences for the links that failed to load.
Remarks:
In cases, where a nested structure of several links were loaded, this
method is intended to be a convenient way for IExternalResourceUIServers to
determine whether a top-level link, or any sub-link, which failed to load
properly was provided by their IExternalResourceServer or another server.
If this link and all nested links loaded successfully, then an empty list is returned.
Returns:
A collection of link ExternalResourceReferences which failed to load.
Since:
2015

Autodesk.Revit.DB.LinkLoadResult.GetNestedLinkLoadResults
Gets the results for this link's nested links.
Remarks:
This function is only relevant for LinkLoadResult object for RvtLinkSymbol.
ie. when getIsRvtLink() is true.
Returns:
A map from nested link paths to the load results for
that nested link.
For links from external servers, the "path" will be
the display name of the link.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.GetLinkLoadResult(Autodesk.Revit.DB.ExternalResourceReference)
Searches this LinkLoadResult and all nested LinkLoadResults for the
load operation results of a specified ExternalResourceReference.
Remarks:
In the case where there are multiple matches, then the LinkLoadResult closest
to the top-level link will be returned.  For example, if you are searching for C,
starting with a top-level link, A, which links B and C, while B also links C directly,
then the load results for C as a direct sub-link of A will be returned.  It is expected
that the LinkLoadResults for all instances of C in the nested load result tree will be
the same.  However, if you need to inspect each individual result, the LinkLoadResult
class does provide methods to navigate the tree.
NULL is returned if a match for the ExternalResourceReference cannot be found.
matchExtResRef:
An ExternalResourceReference whose LinkLoadResults are contained in this object.
Returns:
A LinkLoadResult object with the load results for the specified ExternalResourceReference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.LinkLoadResult.GetExternalResourceReference
Gets a copy of the ExternalResourceReference corresponding
to the link.
Returns:
A copy of the ExternalResourceReference corresponding
to the link.
Since:
2015

Autodesk.Revit.DB.LinkLoadResult.GetCentralModelName
Gets the central model's name.
If the link is not workshared, this returns an empty FilePath.
If the link is itself a central model, this returns the link's name.
Remarks:
If the link could not be found or loaded, this name may be blank.
This function is only relevant for LinkLoadResult object for RvtLinkSymbol.
ie. when getIsRvtLink() is true.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.GetParentModelName
Returns the name of the parent of the linked model, or an empty FilePath
if the link is a top-level link.
Remarks:
This function is only relevant for LinkLoadResult object for RvtLinkSymbol.
ie. when getIsRvtLink() is true.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.GetModelName
Gets the name of the model.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LinkLoadResult.LoadResult
Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded
for success, or a variety of errors. See LinkLoadResultType for the full list.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.IsNested
True if these results represent a nested link; false otherwise.
Remarks:
This property is only relevant for LinkLoadResult object for RvtLinkSymbol.
ie. when getIsRvtLink() is true.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.IsCircularLink
True if these results are part of a link cycle.
Remarks:
A link cycle occurs when, for example, model A links model B as an attachment,
which links model C as an attachment, which links model A as an attachment.
Revit will only load one copy of model A; it will ignore the instance of A linked
under C.
Circular links do not abort the load process, so they do not appear as a result type
in LinkLoadResultType.Enum.
This property is only relevant for LinkLoadResult object for RvtLinkSymbol.
ie. when getIsRvtLink() is true.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.ElementId
The id of the created or loaded linked model.
Remarks:
This may be invalidElementId if there were errors
(for example, LinkLoadResultType.SameModelAsHost
causes no link to be created).
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.#ctor(Autodesk.Revit.DB.LinkLoadResult)
Constructs a new copy of the input LinkLoadResult object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.LinkLoadResult.#ctor
Constructs a new uninitialized LinkLoadResult object.
Since:
2013

Autodesk.Revit.DB.LinkLoadResult
This class stores the results of trying to load a single linked model.
Since:
2013